<!-- dflook/terraform-github-actions {"workspace":"tvm-ci-prod","backend":"e9aea5fb859685b36bd3ba68b07d5b693450871d22c3768bd7a7b293c0fbca80","backend_type":"s3"} -->
Terraform plan in __./terraform__ in the __tvm-ci-prod__ workspace
With var files: `terraform/vars/tvm-ci-prod.auto.tfvars
`
<details>
<summary>Plan: 1 to add, 3 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_bucket.artifacts-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "artifacts-bucket" {
        id                          = "tvm-jenkins-artifacts-prod"
        tags                        = {
            "Name" = "tvm-jenkins-artifacts-prod"
        }
        # (10 unchanged attributes hidden)

      - logging {
          - target_bucket = "bucket-access-logs-tvm-ci-prod" -> null
          - target_prefix = "log/" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bucket" {
        id                          = "tvm-sccache-prod"
        tags                        = {
            "Name" = "tvm-sccache-prod"
        }
        # (10 unchanged attributes hidden)

      - logging {
          - target_bucket = "bucket-access-logs-tvm-ci-prod" -> null
          - target_prefix = "log/" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.vendor_ci_bucket will be destroyed
  # (because aws_s3_bucket.vendor_ci_bucket is not in configuration)
  - resource "aws_s3_bucket" "vendor_ci_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::tvm-vendor-ci-prod" -> null
      - bucket                      = "tvm-vendor-ci-prod" -> null
      - bucket_domain_name          = "tvm-vendor-ci-prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "tvm-vendor-ci-prod.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "tvm-vendor-ci-prod" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "tvm-vendor-ci-prod"
        } -> null
      - tags_all                    = {
          - "Name" = "tvm-vendor-ci-prod"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.head_node.aws_acm_certificate.jenkins_cert must be replaced
+/- resource "aws_acm_certificate" "jenkins_cert" {
      ~ arn                       = "arn:aws:acm:us-west-2:477529581014:certificate/938486f5-e702-4ce3-ac88-5c90e97bedda" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "ci.tlcpack.ai"
              - resource_record_name  = "_1c9b3c4a6a417493d9e5ba68dbbc184a.ci.tlcpack.ai."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_061d95613487c35ca5c55842540c0193.pczglchxlc.acm-validations.aws."
            },
          - {
              - domain_name           = "docs.staging.tlcpack.ai"
              - resource_record_name  = "_1b74cf24068ae103fb72587d3bb79fe5.docs.staging.tlcpack.ai."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ca074ae57799e608bbbfc296a11ae5d2.pczglchxlc.acm-validations.aws."
            },
            # (1 unchanged element hidden)
        ]
      ~ id                        = "***********************************************************************************" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [
          - "docs.staging.tlcpack.ai",
        ] -> (known after apply) # forces replacement
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.head_node.aws_lb_listener.tvm-lb will be updated in-place
  ~ resource "aws_lb_listener" "tvm-lb" {
      ~ certificate_arn   = "arn:aws:acm:us-west-2:477529581014:certificate/938486f5-e702-4ce3-ac88-5c90e97bedda" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-west-2:477529581014:listener/app/tvm-lb/5866961f333179f9/b084371d290c0504"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #115](https://github.com/tlc-pack/ci/actions/runs/3877084569)